using System;

namespace ṧ
{
	// Token: 0x0200000D RID: 13
	internal class gen
	{
		// Token: 0x06000085 RID: 133 RVA: 0x00003314 File Offset: 0x00001514
		public static string test()
		{
			Random random = new Random();
			char[] array = new char[]
			{
				'☼',
				'◙',
				'♂',
				'♀',
				'♪',
				'♫',
				'►',
				'◄',
				'↕',
				'¶',
				'▬',
				'☺',
				'☻',
				'♥',
				'♦',
				'♣',
				'♠',
				'•',
				'◘',
				'○',
				'▲',
				'▼',
				'ž',
				'ř',
				'č',
				'é',
				'í',
				'ÿ',
				'ï',
				'ä',
				'ö',
				'ó',
				'š',
				'ě',
				'╚',
				'╔',
				'╩',
				'╠',
				'╬',
				'╧',
				'╤',
				'╥',
				'↑',
				'■',
				'±',
				'1',
				'2',
				'3',
				'4',
				'5',
				'6',
				'7',
				'8',
				'9',
				'œ',
				'Ÿ',
				'¼',
				'½',
				'¾',
				'ń',
				'£',
				'¤',
				'¥',
				'Â',
				'¢',
				'Æ',
				'Ç',
				'«',
				'¬',
				'®',
				'å',
				'ß',
				'ø',
				'õ',
				'×',
				'ñ',
				'æ',
				'√',
				'ε',
				'₧',
				'Σ',
				'σ',
				'µ',
				'█',
				'▄',
				'▌',
				'▐',
				'▀',
				'∞',
				'π',
				'≈',
				'φ',
				'²',
				'∩',
				'—',
				'™'
			};
			string text = "";
			for (int i = 0; i < 14; i++)
			{
				string str = array[random.Next(array.Length)].ToString();
				text += str;
			}
			return text;
		}
	}
}
